importPackage(Packages.constants);
/*
Production: (Dhae) dhae0107
Purpose: For study and distribution
Code: 1012103 (Henesis Hair Shop [All-Purpose Hair]-Natalie)
Description: Cosmetic & Hair related Beauty & Fish
*/


/*ㅡㅡㅡㅡㅡetcㅡㅡㅡㅡㅡ*/
스킨 = [0, 1, 2, 3, 4, 9, 10, 11, 12, 13]


/*ㅡㅡㅡㅡㅡ1 Listㅡㅡㅡㅡㅡ*/
후여헤어 = [38000, 38010, 38020, 38030, 38040, 38050, 38060, 38070, 38090, 38100, 38110, 38120, 38130, 38270, 38280, 38290, 38300, 38310, 38390, 38400, 38410, 38420, 38430, 38440, 38460, 38470, 38490, 38520, 38540, 38550, 38560, 38570, 38580, 38590, 38600, 38610, 38620, 38630, 38640, 38650, 38660, 38670, 38680, 38690, 38700, 38730, 38740, 38750, 38760, 38800, 38810, 38820, 38840, 38880, 38910, 38940, 39090, 41080, 41090, 41100, 41110, 41120, 41150, 41160, 41200, 41220, 41340, 41350, 41370, 41380, 41390, 41400, 41470, 41480, 41490, 41510, 41520, 41560, 41570, 41590, 41600, 41750, 41950, 38490, 41700, 41860, 41890, 40610, 40780, 40810, 40940, 40950, 40960, 40970, 40980, 41600, 41670, 41700, 41720, 41730, 41740, 41750, 41850, 41860, 44010, 44120, 44130, 44200, 44290, 44320, 44330, 44460, 44461, 44462, 44463, 44464, 44465, 40780, 41900, 44470, 44480, 44490, 44500] // Hair
후남헤어 = [44396, 35000, 35010, 35020, 35030, 35040, 35050, 35060, 35070, 35080, 35090, 35100, 35150, 35180, 35190, 35200, 35210, 35250, 35260, 35280, 35290, 35300, 35310, 35330, 35350, 35360, 35420, 35430, 35440, 35460, 35470, 35480, 35490, 35500, 35510, 35520, 35530, 35540, 35550, 35560, 35570, 35600, 35620, 35630, 35640, 35650, 35660, 35680, 35690, 35710, 35720, 35780, 35790, 35950, 35960, 36010, 36020, 36030, 36040, 36050, 36070, 36080, 36090, 36100, 36130, 36140, 36150, 36160, 36170, 36180, 36190, 36200, 36210, 36220, 36230, 36240, 36250, 36300, 36310, 36330, 36340, 36350, 36380, 36390, 36400, 36410, 36420, 36430, 36440, 36450, 36460, 36470, 36480, 36510, 36520, 36530, 36570, 36580, 36590, 36620, 36630, 36640, 36650, 36670, 36680, 36690, 36700, 36710, 36720, 36730, 36740, 36750, 36760, 36770, 36780, 36790, 36800, 36810, 36820, 36830, 36840, 36850, 36860, 36900, 36910, 36920, 36940, 36950, 36980, 36990, 40000, 40010, 40020, 40050, 40060, 40090, 40100, 40120, 40250, 40260, 40270, 40280, 40290, 40300, 40310, 40320, 40330, 40390, 40400, 40410, 40420, 40440, 40450, 40470, 40480, 40500, 40510, 41060, 41070, 40720, 40600, 40670,36310,35660,  40600, 40640, 40660, 40670, 40690, 40720, 40730, 40740, 40820, 40930, 43020, 43140, 43150, 44140, 44150, 44160, 44170, 44360, 40780, 43290, 43300, 43310, 43320, 43350] // Men's hair
후여성형 = [24001, 24002, 24003, 24004, 24007, 24008, 24011, 24012, 24014, 24015, 24018, 24020, 24021, 24023, 24027, 24031, 24035, 24038, 24039, 24041, 24050, 24058, 24060, 24068, 24071, 24072, 24073, 24077, 24084, 24087, 24088, 24091, 24097, 24099, 25006, 25008, 26003, 26004, 26005, 26008, 26009, 26014, 26017, 26022, 26023, 26026, 26027, 26028, 26029, 26030, 26031, 26032, 26034, 26046, 26047, 26048, 26049, 26050, 26051, 26053, 26056, 26058, 26764, 26763, 26762, 26761, 26760, 26759, 25057, 25157, 26066, 26067] // Female Molding
후남성형 = [23000, 23001, 23002, 23003, 23005, 23006, 23008, 23010, 23011, 23012, 23015, 23016, 23017, 23018, 23019, 23020, 23023, 23024, 23025, 23026, 23027, 23028, 23029, 23031, 23032, 23033, 23035, 23038, 23039, 23040, 23041, 23042, 23043, 23044, 23053, 23054, 23056, 23057, 23060, 23061, 23062, 23063, 23067, 23068, 23069, 23072, 23073, 23074, 23075, 23079, 23080, 23081, 23082, 23083, 23084, 23085, 23086, 23087, 23088, 23089, 23090, 23091, 23092, 23095, 23096, 23097, 23099, 25000, 25004, 25005, 25006, 25007, 25008, 25011, 25014, 25015, 25016, 25017, 25020, 25021, 25022, 25023, 25024, 25025, 25026, 25027, 25029, 25033, 25043, 25044, 25045, 25046, 25047, 25048, 25049, 25051, 25053, 25057, 25063, 25062] // Male
전여헤어 = [31000, 31010, 31020, 31030, 31040, 31050, 31060, 31070, 31080, 31090, 31100, 31110, 31120, 31130, 31140, 31150, 31160, 31170, 31180, 31190, 31200, 31210, 31220, 31230, 31240, 31250, 31260, 31270, 31280, 31290, 31300, 31310, 31320, 31330, 31340, 31350, 31400, 31410, 31420, 31440, 31450, 31460, 31470, 31480, 31490, 31510, 31520, 31530, 31540, 31550, 31560, 31590, 31610, 31620, 31630, 31640, 31650, 31670, 31680, 31690, 31700, 31710, 31720, 31740, 31750, 31780, 31790, 31800, 31810, 31820, 31840, 31850, 31860, 31880, 31890, 31910, 31920, 31930, 31940, 31950, 31990, 34040, 34070, 34080, 34090, 34100, 34110, 34120, 34130, 34140, 34150, 34160, 34170, 34180, 34190, 34210, 34220, 34230, 34240, 34250, 34260, 34270, 34310, 34320, 34330, 34340, 34360, 34370, 34380, 34400, 34410, 34420, 34430, 34440, 34450, 34470, 34480, 34490, 34510, 34540, 34560, 34590, 34600, 34610, 34620, 34630, 34640, 34660, 34670, 34680, 34690, 34700, 34710, 34720, 34730, 34740, 34750, 34760, 34770, 34780, 34790, 34800, 34810, 34820, 34830, 34840, 34850, 34860, 34870, 34880, 34900, 34910, 34940, 34950, 34960, 34970, 37000, 37010, 37020, 37030, 37040, 37060, 37070, 37080, 37090, 37100, 37110, 37120, 37130, 37140, 37190, 37210, 37220, 37230, 37240, 37250, 37260, 37280, 37300, 37310, 37320, 37330, 37340, 37350, 37370, 37380, 37400, 37450, 37460, 37490, 37500, 37510, 37520, 37530, 37560, 37570, 37580, 37610, 37620, 37630, 37640, 37650, 37660, 37670, 37680, 37690, 37700, 37710, 37720, 37730, 37740, 37750, 37760, 37770, 37780, 37790, 37800, 37810, 37820, 37830, 37840, 37850, 37860, 37880, 37910, 37920, 37940, 37950, 37960, 37970, 37980, 37990]; // Hair
전남헤어 = [30000, 30010, 30020, 30030, 30040, 30050, 30060, 30070, 30080, 30090, 30100, 30110, 30120, 30130, 30140, 30150, 30160, 30170, 30180, 30190, 30200, 30210, 30220, 30230, 30240, 30250, 30260, 30270, 30280, 30290, 30300, 30310, 30320, 30330, 30340, 30350, 30360, 30370, 30400, 30410, 30420, 30440, 30450, 30460, 30470, 30480, 30490, 30510, 30520, 30530, 30540, 30560, 30570, 30590, 30610, 30620, 30630, 30640, 30650, 30660, 30670, 30680, 30700, 30710, 30730, 30760, 30770, 30790, 30800, 30810, 30820, 30830, 30840, 30850, 30860, 30870, 30880, 30910, 30930, 30940, 30950, 33030, 33060, 33070, 33080, 33090, 33110, 33120, 33130, 33150, 33170, 33180, 33190, 33210, 33220, 33250, 33260, 33270, 33280, 33310, 33330, 33350, 33360, 33370, 33380, 33390, 33400, 33410, 33430, 33440, 33450, 33460, 33480, 33500, 33510, 33520, 33530, 33550, 33580, 33590, 33600, 33610, 33620, 33630, 33640, 33660, 33670, 33680, 33690, 33700, 33710, 33720, 33730, 33740, 33750, 33760, 33770, 33780, 33790, 33800, 33810, 33820, 33830, 33930, 33940, 33950, 33960, 33990] //Men's hair
전여성형 = [21000, 21001, 21002, 21003, 21004, 21005, 21006, 21007, 21008, 21009, 21010, 21011, 21012, 21013, 21014, 21015, 21016, 21017, 21018, 21019, 21020, 21021, 21023, 21024, 21026, 21027, 21028, 21029, 21030, 21031, 21033, 21035, 21036, 21038, 21041, 21042, 21043, 21044, 21045, 21046, 21047, 21048, 21049, 21050, 21052, 21053, 21054, 21055, 21056, 21057, 21058, 21059, 21060, 21061, 21062, 21063, 21064, 21065, 21066, 21067, 21069, 21070, 21071, 21072, 21073, 21074, 21075, 21077, 21078, 21079, 21080, 21081, 21082, 21083, 21084, 21085, 21086, 21089, 21090, 21091, 21092, 21093, 21094, 21095, 21096, 21097, 21098] // Female Molding
전남성형 = [20000, 20001, 20002, 20003, 20004, 20005, 20006, 20007, 20008, 20009, 20010, 20011, 20012, 20013, 20014, 20015, 20016, 20017, 20018, 20019, 20020, 20021, 20022, 20024, 20025, 20027, 20028, 20029, 20030, 20031, 20032, 20036, 20037, 20040, 20043, 20044, 20045, 20046, 20047, 20048, 20049, 20050, 20051, 20052, 20053, 20055, 20056, 20057, 20058, 20059, 20060, 20061, 20062, 20063, 20064, 20065, 20066, 20067, 20068, 20069, 20070, 20071, 20072, 20074, 20075, 20076, 20077, 20079, 20080, 20081, 20082, 20083, 20084, 20085, 20086, 20087, 20088, 20089, 20090, 20093, 20094, 20095, 20097, 20098, 20099] // Male

/*ㅡㅡㅡㅡㅡCleanup endㅡㅡㅡㅡㅡ*/

function start() {    status = -1;    action(1, 0, 0);}
function action(mode, type, selection) {
    if (status == 1 && mode == 0) {	cm.dispose();	return; }
    if (status == 0 && mode == 0) {	cm.dispose();	return;	}
    if (mode == -1) {	cm.dispose();	return;	}
    if (mode == 0) {	status --;	}
    if (mode == 1) {	status++;	}


if (status == 0) {
	말 ="Your beauty is dazzling ... But if you want to be more perfect, I'll be happy to transform you. "
	말+="#Cgray##fs16#(※ Change the lens and hair color to black before using.)\r\n"
	말+="#L99##rStop the conversation.#l     #L0##Cyellow#Latest Molding#l #L1#Latest hair#l #g#L3#Existing molding#l #L4#Existing hair#l\r\n"
	말 += "#b#L5#Lens color#l #L6#Hair dye#k#l #L7##bSkin color#l  #L8#Change gender#l #L9#Android makeup#k#n"
	cm.sendSpirit(말, true, 0);


}else if(status == 1) {
	if (selection == 99) {
		cm.dispose();
	} else 	if (selection == 0) {
		if (cm.getPlayer().getGender() == 0) {
			sel = 1; 성형 = [];
			for(i=0; i<후남성형.length; i++){
			if (EHF(후남성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100)))
			성형.push(후남성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100));}
			cm.askAvatar("#b#e<1st molding >#k#n It's a system\r\nIf you do not have the desired molding #b#e< Forming 2 >#n#kPlease use", 성형);
		}else{
			sel = 1; 성형 = [];
			for(i=0; i<후여성형.length; i++){
			if (EHF(후여성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100)))
			성형.push(후여성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100));}
			cm.askAvatar("#b#e< 1st molding >#k#n It's a system\r\nIf you do not have the desired molding #b#e< Forming 2 >#n#kPlease use", 성형);
}
	}else if(selection == 1) {	
		if (cm.getPlayer().getGender() == 0) {
			sel = 2; 헤어 = [];
			for(i=0; i<후남헤어.length; i++){
			if (EHF(후남헤어[i]+parseInt(cm.getPlayer().getHair() % 10)))
			헤어.push(후남헤어[i]+parseInt(cm.getPlayer().getHair() % 10));}
			cm.askAvatar("#b#e#b#e< 1번 헤어 >#k#n 시스템이야\r\n원하시는 성형이 없으면 #b#e< 2번 헤어 >#n#k을 이용해줘", 헤어);
		}else{
			sel = 2; 헤어 = [];
			for(i=0; i<후여헤어.length; i++){
			if (EHF(후여헤어[i]+parseInt(cm.getPlayer().getHair() % 10)))
			헤어.push(후여헤어[i]+parseInt(cm.getPlayer().getHair() % 10));}
			cm.askAvatar("#b#e#b#e< 1번 헤어 >#k#n 시스템이야\r\n원하시는 성형이 없으면 #b#e< 2번 헤어 >#n#k을 이용해줘", 헤어);
}
	}else if(selection == 2) {
		if (cm.getPlayer().getGender() == 0) {
			sel = 3; 컬러 = cm.getPlayer().getFace()%100+23000;
			렌즈 = [컬러, 컬러+100, 컬러+200, 컬러+300, 컬러+400, 컬러+500, 컬러+600, 컬러+700];
			cm.askAvatar("#b#e#b#e< 1번 렌즈 >#k#n 시스템이야\r\n원하는 렌즈를 골라봐", 렌즈);
		}else{
			sel = 3; 컬러 = cm.getPlayer().getFace()%100+24000;
			렌즈 = [컬러, 컬러+100, 컬러+200, 컬러+300, 컬러+400, 컬러+500, 컬러+600, 컬러+700];
			cm.askAvatar("#b#e#b#e< 1번 렌즈 >#k#n 시스템이야\r\n원하는 렌즈를 골라봐", 렌즈);
}
	}else if(selection == 3) {	
		if (cm.getPlayer().getGender() == 0) {
			sel = 1; 성형 = [];
			for(i=0; i<전남성형.length; i++){
			if (EHF(전남성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100)))
			성형.push(전남성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100));}
			cm.askAvatar("#b#e< 2번 성형 >#k#n 시스템이야\r\n원하시는 성형이 없으면 #b#e< 1번 성형 >#n#k을 이용해줘", 성형);
		}else{
			sel = 1; 성형 = [];
			for(i=0; i<전여성형.length; i++){
			if (EHF(전여성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100)))
			성형.push(전여성형[i]+cm.getPlayer().getFace()%1000-(cm.getPlayer().getFace()%100));}
			cm.askAvatar("#b#e< 2번 성형 >#k#n 시스템이야\r\n원하시는 성형이 없으면 #b#e< 1번 성형 >#n#k을 이용해줘", 성형);
}
	}else if(selection == 4) {	
		if (cm.getPlayer().getGender() == 0) {
			sel = 2; 헤어 = [];
			for(i=0; i<전남헤어.length; i++){
			if (EHF(전남헤어[i]+parseInt(cm.getPlayer().getHair() % 10)))
			헤어.push(전남헤어[i]+parseInt(cm.getPlayer().getHair() % 10));}
			cm.askAvatar("#b#e#b#e< 2번 헤어 >#k#n 시스템이야\r\n원하시는 성형이 없으면 #b#e< 1번 헤어 >#n#k을 이용해줘", 헤어);
		}else{
			sel = 2; 헤어 = [];
			for(i=0; i<전여헤어.length; i++){
			if (EHF(전여헤어[i]+parseInt(cm.getPlayer().getHair() % 10)))
			헤어.push(전여헤어[i]+parseInt(cm.getPlayer().getHair() % 10));}
			cm.askAvatar("#b#e#b#e< 2번 헤어 >#k#n 시스템이야\r\n원하시는 성형이 없으면 #b#e< 1번 헤어 >#n#k을 이용해줘", 헤어);
}
	}else if(selection == 5) {
		if (cm.getPlayer().getGender() == 0) {
			sel = 3; 컬러 = cm.getPlayer().getFace()%100+20000;
			렌즈D = [컬러, 컬러+100, 컬러+200, 컬러+300, 컬러+400, 컬러+500, 컬러+600, 컬러+700];
			렌즈 = [];
			for (i = 0; i < 렌즈D.length; i ++) {
				if (EHF(렌즈D[i])) {
					렌즈.push(렌즈D[i]);
				}
			}
			cm.askAvatar("#b#e#b#e< 2번 렌즈 >#k#n 시스템이야\r\n원하는 렌즈를 골라봐", 렌즈);
		}else{
			sel = 3; 컬러 = cm.getPlayer().getFace()%100+21000;
			렌즈D = [컬러, 컬러+100, 컬러+200, 컬러+300, 컬러+400, 컬러+500, 컬러+600, 컬러+700];
			렌즈 = [];
			for (i = 0; i < 렌즈D.length; i ++) {
				if (EHF(렌즈D[i])) {
					렌즈.push(렌즈D[i]);
				}
			}
			cm.askAvatar("#b#e#b#e< 2번 렌즈 >#k#n 시스템이야\r\n원하는 렌즈를 골라봐", 렌즈);
}
	}else if(selection == 6) {
		if (cm.getPlayer().getGender() == 0) {	
			sel = 4; 염색 = [];
			컬러 = parseInt(cm.getPlayer().getHair()/10)*10;
			for(i=0; i<8; i++){
			염색.push(컬러 + i);}
			cm.askAvatar("#b#e#b#e< 염색 >#k#n 시스템이야\r\n원하는 색상을 골라봐", 염색);
		}else{
			sel = 4; 염색 = [];
			컬러 = parseInt(cm.getPlayer().getHair()/10)*10;
			for(i=0; i<8; i++){
			염색.push(컬러+i);}	
			cm.askAvatar("#b#e#b#e< 염색 >#k#n 시스템이야\r\n원하는 색상을 골라봐", 염색);
}
	}else if(selection == 7) {
		if (cm.getPlayer().getGender() == 0) {	
			sel = 5
			cm.askAvatar("#b#e#b#e< 스킨 >#k#n 시스템이야\r\n원하는 색상을 골라봐", 스킨);
		}else{
			sel = 5
			cm.askAvatar("#b#e#b#e< 스킨 >#k#n 시스템이야\r\n원하는 색상을 골라봐", 스킨);
}
	}else if(selection == 8) {
		sel = 6
		말 ="너의 성별은"
		if(cm.getPlayer().getGender() == 0){ 
		말+=" #b< 남성 >#k이야 #r< 여성 >#k으로 트렌스젠더가 될꺼야?\r\n#d< #z37300# , #z21078# , 미백 >#k이 적용될꺼야.";
	}else{
		말+=" #r< 여성 >#k이야 #b< 남성 >#k으로 트렌스젠더가 될꺼야?\r\n#d< #z35290# , #z20047# , 미백 >#k이 적용될꺼야.";}
		cm.sendYesNo(말);
	}else if(selection == 9) {
		cm.dispose();
		cm.openNpc(1012123);
}


}else if(status == 2) {
	selection = selection & 0xFF;
	if (sel == 1){ 
		cm.sendOk("어때 #b#z"+성형[selection]+"##k은 마음에 들어?");
		cm.setFace(성형[selection]); cm.dispose();
	}else if(sel == 2){
		cm.sendOk("어때 #b#z"+헤어[selection]+"##k는 마음에 들어?");
		cm.setHair(헤어[selection]); cm.dispose();
      	}else if(sel == 3){
		cm.setFace(렌즈[selection]); cm.dispose();
	}else if(sel == 4){
		cm.sendOk("어때 #b#z"+염색[selection]+"##k는 마음에 들어?");
		cm.setHair(염색[selection]); cm.dispose();
	}else if(sel == 5){
		cm.setSkin(스킨[selection]); cm.dispose();
	}else if(sel == 6){
		if (cm.getPlayer().getGender() == 0) {
		cm.setHair(37300); cm.setFace(21078); cm.setSkin(3); cm.getPlayer().setGender(1);
		cm.fakeRelog(); cm.updateChar(); cm.dispose();
	}else{
		cm.setHair(35290); cm.setFace(20047); cm.setSkin(3); cm.getPlayer().setGender(0);
		cm.fakeRelog();	cm.updateChar(); cm.dispose();
   }
  }
 }
}

function EHF(i) {
	return ServerConstants.real_face_hair.contains("" + i);
}