/*----------------------------------------------------------
	사용안해요 이거

var equipment = [
{'itemid': 4000000, 'qty': 5, 'price': 100},
{'itemid': 4000000, 'qty': 6, 'price': 100}
]
var consumption = [
{'itemid': 4000000, 'qty': 5, 'price': 100},
{'itemid': 4000000, 'qty': 6, 'price': 100}
]
var install = [
{'itemid': 4000000, 'qty': 5, 'price': 100},
{'itemid': 4000000, 'qty': 6, 'price': 100}
]
var other = [
{'itemid': 4000000, 'qty': 5, 'price': 100},
{'itemid': 4000000, 'qty': 6, 'price': 100}
]
var cache = [
{'itemid': 4000000, 'qty': 5, 'price': 100},
{'itemid': 4000000, 'qty': 6, 'price': 100}
]
---------------------------------------------------------*/

var 장비 = [1232072,1302229,1312118,1322164,1402153,1412106,1422109,1432140,1442184,1582030,1452172,1462161,1522073,1592034,1212057,1262028,1282027,1372141,1382170,1242078,1242077,1272027,1332195,1342071,1362069,1472181,1222052,1482142,1492154,1532076];
    //1212063, 1222058, 1232057, 1242060, 1242061, 1302275, 1312153, 1322203, 1332225, 1342082, 1362090, 1372177, 1382208, 1402196, 1412135, 1422140, 1432167, 1442223, 1452205, 1462193, 1472214, 1482168, 1492179, 1522094, 1532098, 1262016, 1582016, 1272015, 1282015];
var 소비 = [1152094,1152095,1152096,1152097,1152098,1072711,1072712,1072713,1072714,1072715,1102456,1102457,1102458,1102459,1102460,1082472,1082473,1082474,1082475,1082476,1132156,1132157,1132158,1132159,1132160];
var 설치 = [1092003,1092004,1092008,1092035,1092045,1092030,1092046,1092047,1102660,1102053,1102054,1102057,1102061,1102064,1102109,1102166,1102211,1102226,1102246,1102370,1102371,1102372,1102590,1102595,1102689,1102923,1102924];
var 기타 = [1003418,1003266,1003979,1002812,1002737,1004057,1002728,1003753,1003219,1002662,1003755,1003758,1003754,1004608,1004607,1003229,1004579,1002663,1002441,1002536,1004650,1001060,1000040,1002418,1002424,1002425,1003693,1003692,1003389,1002699,1002483,1003159,1002869,1003769,1002981,1003528,1002554,1003982,1003981,1003924,1003980,1004604,1004605,1003922,1003999,1003925,1004011,1003409,1003422,1004861,1003028,1004412,1002026,1002089,1002090,1004747,1004748,1002508,1003563,1004615,1004616,1004617,1002069,1002014,1002066,1002067,1002068,1002134,1002133,1002132,1002019,1002080,1002081,1002083,1002020,1002096,1002800,1003360,1003359,1004492,1003414];
var 캐시 = [1022073,1022135,1022136,1022224,1022225,1022226,1022228,1022150,1022151,1022153,1022139,1022089,1022197,1022143,1032010,1032006,1032013,1032014,1032025,1032058,1032059,1032047,1032075,1032077,1032078,1032079,1032092,1032085,1032095,1032098,1032099,1032121,1032122,1032144,1032167,1032054,1032226,1032254,1032001,1032004];
var 캐시1 = [1003601,1003602,1003603,1003604,1003605];
    //, 1003797, 1003798, 1003799, 1003800, 1003801];
var 캐시2 = [1052509,1052510,1052511,1052512,1052513];
//, 1042254, 1042255, 1042256, 1042257, 1042258, 1062165, 1062166, 1062167, 1062168, 1062169];

var 최종상점 = []; // Crystal nono

var 코인 = 4310184;
var cost = 1500;

var enter = "\r\n";
var seld = 0;

function start() {
	status = -1;
	action(1, 0, 0);
}
function action(mode, type, sel) {
	if (mode == 1) {
		status++;
	} else {
		cm.dispose();
		return;
    	}
	if (status == 0) {
		var msg = "#fs11##k#k#d#fs11##fUI/FarmUI.img/objectStatus/star/whole# Hello! I am Azure Equipment Shop."+enter;
		msg += "#fs11##k#k#d#fs11##fUI/FarmUI.img/objectStatus/star/whole# All purchases are made with #i4310184# Blue Orbs.#fs11##b"+enter;
		msg += "#L1# #e#rJapanese Weapon Shop#k"+enter; 
                msg += "#L6# #e#rJapanese Hat Shop"+enter;
                msg += "#L7# #e#rJapanese Overall Shop"+enter;
		msg += "#L2# #e#rItem Shoulder, Shoes, Cloak, Gloves Shop.\r\n\r\n"+enter;
                //msg += "#l#rCurrently Under Construction\r\n"+enter;
		cm.sendSimple(msg);

	} else if (status == 1) {
		최종상점 = sel == 1 ? 장비 : sel == 2 ? 소비 : sel == 3 ? 설치 : sel == 4 ? 기타 : sel == 6 ? 캐시1 : sel == 7 ? 캐시2 : sel == 5 ? 캐시 : [];
		
		var msg = "#fs11##k#k#d#fs11##fUI/FarmUI.img/objectStatus/star/whole# What would you like to purchase."+enter;
		msg += "#fs11##k#k#d#fs11##fUI/FarmUI.img/objectStatus/star/whole# Everything costs #i4310184# Blue Orbs.#fs11##b"+enter+enter;

		for (i = 0; i < 최종상점.length; i++) msg += "#L"+i+"##b#i"+최종상점[i]+"##z"+최종상점[i]+"# 1QTY#k"+enter+"　Orb Count : #b"+cost+"QTY#i4310184##k"+enter;

		cm.sendSimple(msg);
	} else if (status == 2) {

		if (cm.haveItem(코인, cost)) {
			cm.gainItem(최종상점[sel], 1);
			cm.gainItem(코인, -cost);
                        var msg = "#e Information of the item that you purchased."+enter;
                        msg += " Item : #b#i"+최종상점[sel]+"##z"+최종상점[sel]+"##k"+enter;
                        msg += " Count : #b1개 #k"+enter;
                        msg += " Price : #i"+코인+"##z"+코인+"# #b"+cost+"개#k"+enter;
                        msg += " Purchase Completed.";
			cm.sendOk(msg);
			cm.dispose();
		} else {
			cm.sendOk("#b#i"+코인+"##z"+코인+"##kIt looks like you are running out of Blue orbs.");
			cm.dispose();
		}

}
}