


/*

	* 단문엔피시 자동제작 스크립트를 통해 만들어진 스크립트 입니다.

	* (Guardian Project Development Source Script)

	쥰쨩 에 의해 만들어 졌습니다.

	엔피시아이디 : 9901003

	엔피시 이름 : MISSINGNO

	엔피시가 있는 맵 :  : 매직타운 (100050001)

	엔피시 설명 : MISSINGNO


*/

var status = -1;
var skillid = Array(1204,80001163,80001449,80001450,80001451,80001026,80001003,80001004,80001005,80001006,80001007,80001008,80001009,80001010,80001011,80001013,80001014,80001015,80001016,80001017,80001018,80001019,80001020,80001021,80001022,80001023,80001027,80001028,80001038,80001030,80001031,80001032,80001033,80001044,80001082,80001083,80001084,80001090,80001137,80001144,80001148,80001149,80001198,80001220,80001221,80001228,80001237,80001243,80001244,80001246,80001257,80001258,80001261,80001285,80001289,80001290,80001292,80001302,80001304,80001305,80001306,80001307,80001308,80001309,80001312,80001313,80001314,80001315,80001316,80001317,80001318,80001319,80001327,80001331,80001336,80001338,80001333,80001347,80001348,80001353,80001413,80001421,80001423,80001445,80001447,80001484,80001508,80001345,80001199,80001490,80001491,80001505,80001492,80001503,80001531,80001549,80001550,80001355,80001411,80001552,80001553,80001554,80001555,80001557,80001558,80001453,80001517,80001533,80001561,80001562,80001563,80001324,80001398,80001400,80001582,80001564,80001565,80001566,80001567,80001568,80001569);
var sel = 0;

function start() {
    status = -1;
    action (1, 0, 0);
}

function action(mode, type, selection) {

    if (mode == 1) {
        status++;
    } else {
	cm.dispose();
	return;
    }

    if (status == 0) {
	var chat = "#e(긁적 긁적)#n 사고싶은 라이딩을 선택해봐";
	for (var i = 0; i < skillid.length; i ++) {
		chat += "\r\n#L" + i + "##b#s" + skillid[i] + "# #q" + skillid[i] + "# : #r#e10,000,000 메소#n#l";
	}
	cm.sendSimple(chat);
    } else if (status == 1) {
	sel = selection;
	cm.sendYesNo("정말로 #b#q" + skillid[sel] + "##k(을)를 구매 하겠어?");
    } else if (status == 2) {
	if (cm.getMeso() < 10000000) {
		cm.sendOk("라이딩을 사기에는 메소가 부족하다고 생각하지 않아?");
		cm.dispose();
		return;
	}
	if (cm.getPlayer().getSkillLevel(skillid[sel]) > 0) {
		cm.sendOk("이미 보유중인 라이딩은 중복구매가 불가능해");
		cm.dispose();
		return;
	}
	cm.sendOk("스킬창에 #b#q" + skillid[sel] + "##k(을)를 지급했으니 확인해봐");
	cm.teachSkill(skillid[sel],1,1);
	cm.gainMeso(-10000000);
	cm.dispose();
    }
}
