/*
     Copyright ⓒ 2012- ONLineWorld Allright Reserved.

    본 스크립트는 온라인월드의 개발자인 OnS온 라인이 제작한 스크립트입니다.
    재 배포 및 게시, 또 다른 서버 드라이브에 포함해 배포하는 것을 금하며,
    제작자의 허락 없이 본 주석을 지우는 것을 허용하지 아니합니다.

    오류가 나지 않는 이상 본 스크립트를 수정 할 수 없고,
    만약 무단으로 사용되고 있음을 알게 되면

    OnS온 라인<kkong1001@naver.com>에게 연락을 해주시길 바랍니다.

    NPC : 장비
 */

var talk = "";
var menu = ["공통", "전사", "마법사", "궁수", "도적", "해적", "캐시", "코인샵"];
var common = [["모자", 10001], ["귀고리", 10004], ["신발", 10005], ["망토", 10006], ["상의", 10007], ["장갑", 10008], ["한벌옷", 10009], ["하의", 10010], ["방패", 10012], ["악세사리", 10013], ["한손도끼", 10016], ["두손도끼", 10017], ["한손둔기", 10018], ["두손둔기", 10019], ["단검", 10023], ["폴암", 10026], ["창", 10027], ["한손검", 10029], ["두손검", 10030], ["완드", 10031], ["카르트", 10032], ["케인", 10036]];
var warrior = [["모자", 10101], ["신발", 10105], ["상의", 10107], ["장갑", 10108], ["한벌옷", 10109], ["망토",10106], ["얼굴장식",10102], ["악세사리" ,10113], ["훈장", 10114], ["하의", 10110], ["방패", 10112], ["한손도끼", 10116], ["두손도끼", 10117], ["한손둔기", 10118], ["두손둔기", 10119], ["폴암", 10126], ["창", 10127], ["한손검", 10129], ["두손검", 10130], ["오브", 10132]];
var mage = [["모자", 10201], ["신발", 10205], ["상의", 10207], ["장갑", 10208], ["한벌옷", 10209], ["하의", 10210], ["악세사리", 10213], ["얼굴장식", 10202], ["망토", 10206], ["훈장", 10214], ["방패", 10212], ["스태프", 10228], ["완드", 10231], ["샤이닝로드", 10232]];
var archer = [["모자", 10301], ["신발", 10305], ["상의", 10307], ["장갑", 10308], ["한벌옷", 10309], ["하의", 10310], ["악세사리", 10313], ["얼굴장식" ,10302], ["망토", 10306], ["훈장", 10314], ["활", 10320], ["석궁", 10322], ["듀얼보우건", 10337], ["오브", 10332]];
var thief = [["모자", 10401], ["신발", 10405], ["상의", 10407], ["장갑", 10408], ["한벌옷", 10409], ["하의", 10410], ["악세사리",10413], ["얼굴장식",10402], ["망토", 10406], ["훈장", 10414], ["방패", 10412], ["한손도끼", 10416], ["아대", 10421], ["단검", 10423], ["한손검", 10429], ["완드", 10431], ["오브", 10432], ["케인", 10436], ["오브", 10432]];
var pirate = [["모자", 10501], ["신발", 10505], ["장갑", 10508], ["한벌옷", 10509], ["악세사리", 10513], ["얼굴장식", 10502], ["망토", 10506], ["훈장", 10514], ["무기", 10515], ["총", 10524], ["너클", 10525], ["소울슈터", 10533], ["오브", 10532]];
var cash = [["모자", 10601], ["얼굴장식", 10602], ["눈장식", 10603], ["귀고리", 10604], ["신발", 10605], ["망토", 10606], ["상의", 10607], ["장갑", 10608], ["한벌옷", 10609], ["하의", 10610], ["반지", 10611], ["방패", 10612], ["무기", 10615], ["완드", 10631]];
var coin = [["저스티스", 9010040], ["투신증표", 9000069], ["캐시코인", 2200010]];

c = -1;
npc = 0;

function start() {
    var text = "안녕하세요, #h0#님? 원하시는 항목을 선택해주세요.\r\n\r\n#b";
    for (var i = 0; i < menu.length; i++) text+= "#L" + i + "#" + menu[i] + "#l\r\n";
    cm.sendSimple(text);
}

function action(m, t, s) {
    if (m != 1) {
        cm.dispose();
        return;
    } else npc++;
    if (npc == 1) {
        c = s;
        talk = "#b";
        for (var j = 0; j < shops(s).length; j++) talk += "#L" + j + "# " + shops(s)[j][0] +"#l\r\n";
        cm.sendSimple(talk);
    } else if (npc == 2) {
        cm.openShop(shops(c)[s][1]);
        cm.dispose();
    }
}

function shops(s) {
    s -= 1;
    switch (s) {
        case -1: return common;
        case 0: return warrior;
        case 1: return mage;
        case 2: return archer;
        case 3: return thief;
        case 4: return pirate;
        case 5: return cash;
        case 6: return coin;
    }
    return common;
}